<a href="https://colab.research.google.com/github/subhajitmajumder/python_program/blob/master/pandas_part2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

## Creating Ddataframe Object

In [ ]:
# Creating 2D array

arr = np.random.randint(0, 10, (5, 3))

In [ ]:
arr

array([[9, 6, 6],
       [3, 5, 4],
       [9, 0, 6],
       [9, 8, 2],
       [9, 1, 3]])

Typically **df** is the most common name of dataframe object, as in most data analysis efforts we need to collect data and store it in one variable.

In [ ]:
df = pd.DataFrame(arr)

In [ ]:
df

   0  1  2
0  9  6  6
1  3  5  4
2  9  0  6
3  9  8  2
4  9  1  3

We can see that after creating the dataframe each row and column has a name or we can say there are implicit indexing.

In [ ]:
df.values

array([[9, 6, 6],
       [3, 5, 4],
       [9, 0, 6],
       [9, 8, 2],
       [9, 1, 3]])

In [ ]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [ ]:
# We can iterate over columns
for c in df.columns:
    print(c)

0
1
2

In [ ]:
# Also we can access values using index
df.values[0]

array([9, 6, 6])

In [ ]:
# We can also change the implicit indexes and columns names with our own

df.index = ['R1', 'R2', 'R3', 'R4', 'R5']
df.columns = ['C1', 'C2', 'C3']

In [ ]:
df

    C1  C2  C3
R1   9   6   6
R2   3   5   4
R3   9   0   6
R4   9   8   2
R5   9   1   3

In [ ]:
# We can use loc to access explicit indexing

df.loc["R3", "C2"]

0

In [ ]:
# We can use iloc to access imlicit indexing

df.iloc[2,1]

0

In [ ]:
# We also can subset this Dataframe by using implicit indexing.

df.iloc[2:4, 1:3]

    C2  C3
R3   0   6
R4   8   2

In [ ]:
#We can also create a subset of DataFrame by using explicit indexing

df.loc["R3":"R4", "C2":"C3"] # In this case the 2nd index is also included

    C2  C3
R3   0   6
R4   8   2

In [ ]:
# We can also return a series object from the dataframe

df.iloc[0]

C1    9
C2    6
C3    6
Name: R1, dtype: int64

In [ ]:
type(df.iloc[0])

pandas.core.series.Series

In [ ]:
type(df.iloc[:, 0]) # For this slice it is a series

pandas.core.series.Series

In [ ]:
type(df.iloc[:, 0:2]) # For this slice it is a DataFrame

pandas.core.frame.DataFrame

In [ ]:
df.shape

(5, 3)

In [ ]:
df.T # We can transpose the dataframe

    R1  R2  R3  R4  R5
C1   9   3   9   9   9
C2   6   5   0   8   1
C3   6   4   6   2   3

Task to create random dataframes

In [ ]:
def create_df(nRows, nCols, maxValue=10):
    arr = np.random.randint(0, maxValue, (nRows, nCols))
    df = pd.DataFrame(arr)
    df.index = ['R' + str(x) for x in np.arange(1, nRows+1)]
    df.columns = ['C' + str(x) for x in np.arange(1, nCols+1)]
    return df

In [ ]:
df1 = create_df(4, 5, 100)
df1

    C1  C2  C3  C4  C5
R1  20  89  36  35  23
R2  40  34  68   5  85
R3  83  73  20  81  51
R4  11  46  17  36   4

In [ ]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.146],
                 index = ['Murcury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

diameter = pd.Series([4878, 12104, 12756, 6794, 142984, 120536, 51118, 49532, 2370, 3475],
                     index = ['Murcury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto', 'Moon'])

In [ ]:
mass

Murcury       0.330
Venus         4.870
Earth         5.970
Mars          0.642
Jupiter    1898.000
Saturn      568.000
Uranus       86.800
Neptune     102.000
Pluto         0.146
dtype: float64

In [ ]:
diameter

Murcury      4878
Venus       12104
Earth       12756
Mars         6794
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49532
Pluto        2370
Moon         3475
dtype: int64

We can take these both different datatype object and convert it into pandas DataFrame

In [ ]:
df = pd.DataFrame({"Mass":mass, "Diameter":diameter})

In [ ]:
df

             Mass  Diameter
Earth       5.970     12756
Jupiter  1898.000    142984
Mars        0.642      6794
Moon          NaN      3475
Murcury     0.330      4878
Neptune   102.000     49532
Pluto       0.146      2370
Saturn    568.000    120536
Uranus     86.800     51118
Venus       4.870     12104

In [ ]:
df['Mass']

Earth         5.970
Jupiter    1898.000
Mars          0.642
Moon            NaN
Murcury       0.330
Neptune     102.000
Pluto         0.146
Saturn      568.000
Uranus       86.800
Venus         4.870
Name: Mass, dtype: float64

In [ ]:
df['Diameter']

Earth       12756
Jupiter    142984
Mars         6794
Moon         3475
Murcury      4878
Neptune     49532
Pluto        2370
Saturn     120536
Uranus      51118
Venus       12104
Name: Diameter, dtype: int64

We cant access data for Earth or Mars directly.

In [ ]:
df['Earth']

KeyError: ignored

As Earth is not a key in the column space so it has appeared Keyerror. So we can access it in other ways.

In [ ]:
df['Mass']['Earth']

5.97

Now we can add another column to this dataframe.

In [ ]:
df['Population'] = 0

In [ ]:
df

             Mass  Diameter  Population
Earth       5.970     12756           0
Jupiter  1898.000    142984           0
Mars        0.642      6794           0
Moon          NaN      3475           0
Murcury     0.330      4878           0
Neptune   102.000     49532           0
Pluto       0.146      2370           0
Saturn    568.000    120536           0
Uranus     86.800     51118           0
Venus       4.870     12104           0

We can change individual values of the columns.

In [ ]:
df['Population']['Earth'] = 800000000

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df

             Mass  Diameter  Population
Earth       5.970     12756   800000000
Jupiter  1898.000    142984           0
Mars        0.642      6794           0
Moon          NaN      3475           0
Murcury     0.330      4878           0
Neptune   102.000     49532           0
Pluto       0.146      2370           0
Saturn    568.000    120536           0
Uranus     86.800     51118           0
Venus       4.870     12104           0

We can access single value by using loc

In [ ]:
df.loc['Earth'] # Accessing the row

Mass          5.970000e+00
Diameter      1.275600e+04
Population    8.000000e+08
Name: Earth, dtype: float64

In [ ]:
df.loc[:, 'Mass'] # Accessing the whole column

Earth         5.970
Jupiter    1898.000
Mars          0.642
Moon            NaN
Murcury       0.330
Neptune     102.000
Pluto         0.146
Saturn      568.000
Uranus       86.800
Venus         4.870
Name: Mass, dtype: float64

Adding row

In [ ]:
def create_mean_row(df):
    #df.loc['Col_Mean'] = [np.mean(df[col]) for col in df.columns]
    df.loc['Col_Mean'] = df.mean()  # Faster way
    return df

In [ ]:
df

             Mass  Diameter  Population
Earth       5.970     12756   800000000
Jupiter  1898.000    142984           0
Mars        0.642      6794           0
Moon          NaN      3475           0
Murcury     0.330      4878           0
Neptune   102.000     49532           0
Pluto       0.146      2370           0
Saturn    568.000    120536           0
Uranus     86.800     51118           0
Venus       4.870     12104           0

In [ ]:
df.loc['col_mean'] = 0

In [ ]:
df

              Mass  Diameter  Population
Earth        5.970     12756   800000000
Jupiter   1898.000    142984           0
Mars         0.642      6794           0
Moon           NaN      3475           0
Murcury      0.330      4878           0
Neptune    102.000     49532           0
Pluto        0.146      2370           0
Saturn     568.000    120536           0
Uranus      86.800     51118           0
Venus        4.870     12104           0
col_mean     0.000         0           0

In [ ]:
# Deleting a row
df.drop('col_mean', inplace=True)

In [ ]:
df

             Mass  Diameter  Population
Earth       5.970     12756   800000000
Jupiter  1898.000    142984           0
Mars        0.642      6794           0
Moon          NaN      3475           0
Murcury     0.330      4878           0
Neptune   102.000     49532           0
Pluto       0.146      2370           0
Saturn    568.000    120536           0
Uranus     86.800     51118           0
Venus       4.870     12104           0

In [ ]:
# Delete a column
df.drop('Population', axis=1, inplace=True)

In [ ]:
df

             Mass  Diameter
Earth       5.970     12756
Jupiter  1898.000    142984
Mars        0.642      6794
Moon          NaN      3475
Murcury     0.330      4878
Neptune   102.000     49532
Pluto       0.146      2370
Saturn    568.000    120536
Uranus     86.800     51118
Venus       4.870     12104

In [ ]:
df.loc['col_mean'] = [np.mean(df['Mass']), np.mean(df['Diameter'])]

In [ ]:
df

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6794.0
Moon              NaN    3475.0
Murcury      0.330000    4878.0
Neptune    102.000000   49532.0
Pluto        0.146000    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
col_mean   296.306444   40654.7

In [ ]:
df.drop('col_mean', inplace=True)

In [ ]:
create_mean_row(df)

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6794.0
Moon              NaN    3475.0
Murcury      0.330000    4878.0
Neptune    102.000000   49532.0
Pluto        0.146000    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_Mean   296.306444   40654.7

In [ ]:
df = create_df(5, 3)

In [ ]:
df

    C1  C2  C3
R1   6   4   3
R2   0   0   8
R3   0   1   8
R4   4   5   1
R5   8   9   1

In [ ]:
df.mean()  # Column wise mean

C1    3.6
C2    3.8
C3    4.2
dtype: float64

In [ ]:
df.mean(axis = 1)  # Row wise mean

R1    4.333333
R2    2.666667
R3    3.000000
R4    3.333333
R5    6.000000
dtype: float64

In [ ]:
# Can add a row in the dataframe
df['Row_Mean'] = df.mean(axis=1)

In [ ]:
df

    C1  C2  C3  Row_Mean
R1   6   4   3  4.333333
R2   0   0   8  2.666667
R3   0   1   8  3.000000
R4   4   5   1  3.333333
R5   8   9   1  6.000000

In [ ]:
df['Col_Mean'] = df.mean()

In [ ]:
df.drop('Col_Mean',axis = 1,  inplace=True)

In [ ]:
df.loc['Col_Mean'] = df.mean()

In [ ]:
df

           C1   C2   C3  Row_Mean
R1        6.0  4.0  3.0  4.333333
R2        0.0  0.0  8.0  2.666667
R3        0.0  1.0  8.0  3.000000
R4        4.0  5.0  1.0  3.333333
R5        8.0  9.0  1.0  6.000000
Col_Mean  3.6  3.8  4.2  3.866667

In [ ]:
df.median()

C1          3.8
C2          3.9
C3          3.6
Row_Mean    3.6
dtype: float64

In [ ]:
df.min()

C1          0.000000
C2          0.000000
C3          1.000000
Row_Mean    2.666667
dtype: float64

In [ ]:
df.max()

C1          8.0
C2          9.0
C3          8.0
Row_Mean    6.0
dtype: float64

In [ ]:
df.quantile(0.25)

C1          0.900000
C2          1.700000
C3          1.500000
Row_Mean    3.083333
Name: 0.25, dtype: float64

In [ ]:
df.drop('Row_Mean', axis = 1, inplace=True)

In [ ]:
# We can get many statistical values with a simple function
df.describe()

        C1        C2        C3
count  6.0  6.000000  6.000000
mean   3.6  3.800000  4.200000
std    3.2  3.187475  3.187475
min    0.0  0.000000  1.000000
25%    0.9  1.700000  1.500000
50%    3.8  3.900000  3.600000
75%    5.5  4.750000  7.050000
max    8.0  9.000000  8.000000

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

In [ ]:
df = sns.load_dataset('planets')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [ ]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

# Data Cleaning

Go through each row of the dataset and delete it(drop) if any column is null

In [ ]:
for r in df.index:
    for c in df.columns:
        if pd.isnull(df.loc[r, c]):
            df.drop(r, inplace=True)
            break

In [ ]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

We can do this previous code in a better way by using iterrows

In [ ]:
df = sns.load_dataset('planets')

In [ ]:
for i, r in df.iterrows():
    print(i)
    print(r)
    break

0
method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [ ]:
for i, r in df.iterrows():
   if pd.isnull(r).any(): # if any of the value of a row is null then all values of the row returns null
       df.drop(i, inplace=True)

In [ ]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
df = sns.load_dataset('planets')

In [ ]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

We can do all the previous tasks i.e. dropping rows which contains null cell by applying a very simple function.

In [ ]:
df.dropna(inplace=True)

In [ ]:
df.describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [ ]:
df

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

## Data Filtering or subseting

Filter and show only those rows which have planets that are found in the 2010s and method is 'Radial Velocity' and 'Transit' and distance is large (> 75 percentile)

In [ ]:
df_ = df.copy()
per_75 = df.distance.quantile(0.75)
for i, r in df_.iterrows():
    if r['year'] < 2010:
        df_.drop(i, inplace=True)
        continue
    if r['method'] != 'Radial Velocity' and r['method'] != 'Transit':
        df_.drop(i, inplace=True)
        continue
    if r['distance'] < per_75:
        df_.drop(i, inplace=True)
        continue

In [ ]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

In [ ]:
df_.head()

             method  number  orbital_period   mass  distance  year
9   Radial Velocity       2          452.80   1.99     74.79  2010
10  Radial Velocity       2          883.00   0.86     74.79  2010
58  Radial Velocity       1          277.02   1.70     80.64  2013
63  Radial Velocity       1          305.50  20.60     92.51  2013
84  Radial Velocity       1          137.48   1.11    175.44  2013

We can do this in more efficient ways actually.

In [ ]:
df_ = df.copy()

In [ ]:
df_ = df_[
          (df_['year'] >= 2010) &
          ((df_['method'] == 'Radial Velocity') | (df_['method'] == 'Transit')) &
          (df_['distance'] > per_75)
]

In [ ]:
df_.describe()

          number  orbital_period       mass    distance         year
count  50.000000       50.000000  50.000000   50.000000    50.000000
mean    1.300000      763.904808   3.322740  133.142600  2011.360000
std     0.505076      966.789870   3.648002   70.378699     1.120496
min     1.000000        2.703390   0.770000   65.620000  2010.000000
25%     1.000000      255.555000   1.325000   80.205000  2011.000000
50%     1.000000      550.500000   1.875000  121.070000  2011.000000
75%     2.000000      873.625000   3.400000  150.097500  2012.000000
max     3.000000     5584.000000  20.600000  354.000000  2014.000000

## Data Manipulation

Modify the method column to have only the abbreviations of each method.

In [ ]:
df = sns.load_dataset('planets')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [ ]:
df.method.unique() # TO check how many unique values are there.

array(['Radial Velocity', 'Imaging', 'Eclipse Timing Variations',
       'Transit', 'Astrometry', 'Transit Timing Variations',
       'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing',
       'Pulsation Timing Variations'], dtype=object)

In [ ]:
s = 'Radial Velocity'

In [ ]:
''.join([x[0] for x in s.split(" ")])

'RV'

We need to do this previous operation for every values in that column so we need to iterate over method column and give it short name.

In [ ]:
short_name = {}
for s in df.method.unique():
    short_name[s] = ''.join([x[0] for x in s.split(" ")])
short_name

{'Astrometry': 'A',
 'Eclipse Timing Variations': 'ETV',
 'Imaging': 'I',
 'Microlensing': 'M',
 'Orbital Brightness Modulation': 'OBM',
 'Pulsar Timing': 'PT',
 'Pulsation Timing Variations': 'PTV',
 'Radial Velocity': 'RV',
 'Transit': 'T',
 'Transit Timing Variations': 'TTV'}

In [ ]:
for i, r in df.iterrows():
    df.loc[i, 'short_method'] = short_name.get(r['method'], r['method'])

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

We again can do this previous operation more efficiently.

In [ ]:
df = sns.load_dataset('planets')

In [ ]:
def shorten_method(s):
    return short_name.get(s, s) # short_name is the dictionary which we have created previously

In [ ]:
df['short_method'] = df['method'].apply(shorten_method)

In [ ]:
df.head()

            method  number  orbital_period   mass  distance  year short_method
0  Radial Velocity       1         269.300   7.10     77.40  2006           RV
1  Radial Velocity       1         874.774   2.21     56.95  2008           RV
2  Radial Velocity       1         763.000   2.60     19.84  2011           RV
3  Radial Velocity       1         326.030  19.40    110.62  2007           RV
4  Radial Velocity       1         516.220  10.50    119.47  2009           RV

Count the number of planets discovered for each method type

**Step 1:** Split the dataframe into smaller chunks (in this case they should have the same method name)

**Step 2** Apply some function in each smaller chunk (in this case it is the count function)

**Step 3** Aggregate the results from each chunk together

In [ ]:
 d = {}
 for m in df.method.unique():
    d[m] = df[df.method == m]['method'].count()
print(d)

{'Radial Velocity': 553, 'Imaging': 38, 'Eclipse Timing Variations': 9, 'Transit': 397, 'Astrometry': 2, 'Transit Timing Variations': 4, 'Orbital Brightness Modulation': 3, 'Microlensing': 23, 'Pulsar Timing': 5, 'Pulsation Timing Variations': 1}

We can  again do this above operation using groupby method

In [ ]:
df.groupby('method')['method'].count()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: method, dtype: int64

We can use groupby to find other things also.

In [ ]:
df.groupby('method')['distance'].mean()

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

Find out what fraction of planets have been found in the last decade(i.e. in 2010s) accross each method type.

1. **Filter** the data for the given condition (in this case planet found in last decade)

2. **Split** (in this case across method)

3. **Apply** (in this case just count)

4. **Aggregate** (to represent the final result)

In [ ]:
# By this method we can find all the method which was used during last decade
s_2010 = df[df['year'] >= 2010].groupby('method')['method'].count()

In [ ]:
# Total count of planets searched through different methods through out the years
s_allTime = df.groupby('method')['method'].count()

In [ ]:
s_2010/s_allTime * 100

method
Astrometry                       100.000000
Eclipse Timing Variations         66.666667
Imaging                           47.368421
Microlensing                      56.521739
Orbital Brightness Modulation    100.000000
Pulsar Timing                     20.000000
Pulsation Timing Variations             NaN
Radial Velocity                   38.878843
Transit                           84.382872
Transit Timing Variations        100.000000
Name: method, dtype: float64

Find a dataset of Nifty numbers for 2018 and 2019 - daily numbers open,  close, high, low

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv')

In [ ]:
nifty50_2018.head()

          Date      Open      High  ...     Close  Shares Traded  Turnover (Rs. Cr)
0  01-Jan-2018  10531.70  10537.85  ...  10435.55      134532090            7546.56
1  02-Jan-2018  10477.55  10495.20  ...  10442.20      158092430            8665.47
2  03-Jan-2018  10482.65  10503.60  ...  10443.20      172516859            9541.60
3  04-Jan-2018  10469.40  10513.00  ...  10504.80      180257392            9561.95
4  05-Jan-2018  10534.25  10566.10  ...  10558.85      186469717           10306.22

[5 rows x 7 columns]

In the above case there are proper indexing before date column but we can use the date column as index.

In [ ]:
nifty50_2018 = pd.read_csv('NIFTY50_2018.csv', index_col=0)

In [ ]:
nifty50_2018.head()

                 Open      High  ...  Shares Traded  Turnover (Rs. Cr)
Date                             ...
01-Jan-2018  10531.70  10537.85  ...      134532090            7546.56
02-Jan-2018  10477.55  10495.20  ...      158092430            8665.47
03-Jan-2018  10482.65  10503.60  ...      172516859            9541.60
04-Jan-2018  10469.40  10513.00  ...      180257392            9561.95
05-Jan-2018  10534.25  10566.10  ...      186469717           10306.22

[5 rows x 6 columns]

In [ ]:
nifty50_2018.loc['24-Dec-2018']

Open                 1.078090e+04
High                 1.078230e+04
Low                  1.064925e+04
Close                1.066350e+04
Shares Traded        2.302913e+08
Turnover (Rs. Cr)    1.069560e+04
Name: 24-Dec-2018, dtype: float64

In [ ]:
nifty50_2018['Open']

Date
01-Jan-2018    10531.70
02-Jan-2018    10477.55
03-Jan-2018    10482.65
04-Jan-2018    10469.40
05-Jan-2018    10534.25
                 ...
24-Dec-2018    10780.90
26-Dec-2018    10635.45
27-Dec-2018    10817.90
28-Dec-2018    10820.95
31-Dec-2018    10913.20
Name: Open, Length: 246, dtype: float64

In [ ]:
nifty50_2019 = pd.read_csv('NIFTY50_2019.csv', index_col=0)

In [ ]:
nifty50_2019.head()

                 Open      High  ...  Shares Traded  Turnover (Rs. Cr)
Date                             ...
01-Jan-2019  10881.70  10923.60  ...      159404542            8688.26
02-Jan-2019  10868.85  10895.35  ...      309665939           15352.25
03-Jan-2019  10796.80  10814.05  ...      286241745           15030.45
04-Jan-2019  10699.70  10741.05  ...      296596655           14516.74
07-Jan-2019  10804.85  10835.95  ...      269371080           12731.29

[5 rows x 6 columns]

In the case of same type of datasets we can concatinate these two datasets row wise

In [ ]:
print(nifty50_2018.shape, nifty50_2019.shape)

(246, 6) (245, 6)

In [ ]:
nifty50 = pd.concat([nifty50_2018, nifty50_2019])

In [ ]:
nifty50.shape

(491, 6)

In [ ]:
niftynext50_2019 = pd.read_csv('NIFTYNEXT50_2019.csv', index_col=0)

In [ ]:
niftynext50_2019

                 Open      High  ...    Shares Traded  Turnover (Rs. Cr)
Date                             ...
01-Jan-2019  28243.95  28252.20  ...        100916543            2354.60
02-Jan-2019  28074.05  28188.40  ...        167334185            3410.28
03-Jan-2019  27874.05  28045.30  ...        175238949            3362.20
04-Jan-2019  27707.20  27842.75  ...        163387940            3295.06
07-Jan-2019  27893.95  27932.00  ...        135700262            2862.02
...               ...       ...  ...              ...                ...
24-Dec-2019  28423.70  28430.40  ...        250955193            4047.51
26-Dec-2019  28409.10  28435.25  ...        341108696            4493.23
27-Dec-2019  28354.50  28500.25  ...        324272733            4776.47
30-Dec-2019  28528.95  28612.95  ...        291220117            3492.11
31-Dec-2019  28495.00  28549.50  ...        315369397            4223.10

[245 rows x 6 columns]

Now we concat nifty50_2019 and niftynext50_2019 dataset column wise

In [ ]:
nifty2019 = pd.concat([nifty50_2019, niftynext50_2019], axis = 1)

In [ ]:
nifty2019.head()

              nifty50            ...      niftynext50
                 Open      High  ...    Shares Traded Turnover (Rs. Cr)
Date                             ...
01-Jan-2019  10881.70  10923.60  ...        100916543           2354.60
02-Jan-2019  10868.85  10895.35  ...        167334185           3410.28
03-Jan-2019  10796.80  10814.05  ...        175238949           3362.20
04-Jan-2019  10699.70  10741.05  ...        163387940           3295.06
07-Jan-2019  10804.85  10835.95  ...        135700262           2862.02

[5 rows x 12 columns]

In [ ]:
nifty2019.shape

(245, 12)

In the above case we see that there are some columns which are same names. Therefore it creates confusions and this is not a good practice.

For this case there is an advance concept called hierarchical indexing

In [ ]:
nifty2019 = pd.concat([nifty50_2019, niftynext50_2019],
                      axis = 1,
                      keys = ['nifty50', 'niftynext50'])

In [ ]:
nifty2019.head()

              nifty50            ...      niftynext50
                 Open      High  ...    Shares Traded Turnover (Rs. Cr)
Date                             ...
01-Jan-2019  10881.70  10923.60  ...        100916543           2354.60
02-Jan-2019  10868.85  10895.35  ...        167334185           3410.28
03-Jan-2019  10796.80  10814.05  ...        175238949           3362.20
04-Jan-2019  10699.70  10741.05  ...        163387940           3295.06
07-Jan-2019  10804.85  10835.95  ...        135700262           2862.02

[5 rows x 12 columns]

Interestingly now we can access different slices of the dataframe.

In [ ]:
nifty2019['nifty50']['Close']

Date
01-Jan-2019    10910.10
02-Jan-2019    10792.50
03-Jan-2019    10672.25
04-Jan-2019    10727.35
07-Jan-2019    10771.80
                 ...
24-Dec-2019    12214.55
26-Dec-2019    12126.55
27-Dec-2019    12245.80
30-Dec-2019    12255.85
31-Dec-2019    12168.45
Name: Close, Length: 245, dtype: float64

In [ ]:
nifty2019['nifty50']['Close'].loc['02-Jan-2019']

10792.5

In [ ]:
nifty2019['nifty50'].loc['02-Jan-2019']

Open                 1.086885e+04
High                 1.089535e+04
Low                  1.073505e+04
Close                1.079250e+04
Shares Traded        3.096659e+08
Turnover (Rs. Cr)    1.535225e+04
Name: 02-Jan-2019, dtype: float64

In [ ]:
import pandas as pd
# years2days = lambda x: x * 365.25
data = [['A', 10], ['B', 15], ['C', 14], ['D', 14], ['E', 12], ['F', 10], ['G', 11]]
df = pd.DataFrame(data, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g'],  columns = ['Name', 'Age'])
df

  Name  Age
a    A   10
b    B   15
c    C   14
d    D   14
e    E   12
f    F   10
g    G   11

Tasks on the NIFTY Datasets:

1. In 2019, in how many days was the NIFTY50 volatile (high > 105% of low)

2. In 2019, in how many days was the NIFTYNEXT50 volatile (high > 105% of low)

3. In 2019, how many days belonged to the four classes NIFTY50 volatile/ non-volatile and NIFTYNEXT50 volatile/ non-volatile

4. Compute the mean, median, mode, std, var of closing values for the each weekday in NIFTY50 for 2019

5. Compute the mean, median, mode, std, var of closing values for the each month in NIFTY50 for 2019

6. On the days in which NIFTY50 closed higher than the open, what was the mean of (close - open) for NIFTYNext50

7. In 2019, how many days had the day's high lower than the previous day's low in NIFTY50

8. In 2019, how many days did the day's close exceed the 30 day moving average in NIFTY50(exclude first month)

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
nifty2018 = pd.read_csv('NIFTY50_2018.csv', index_col=0)
nifty2019 = pd.read_csv('NIFTY50_2019.csv', index_col=0)
niftynxt2019 = pd.read_csv('NIFTYNEXT50_2019.csv', index_col=0)

In [ ]:
nifty2019.head()

                 Open      High  ...  Shares Traded  Turnover (Rs. Cr)
Date                             ...
01-Jan-2019  10881.70  10923.60  ...      159404542            8688.26
02-Jan-2019  10868.85  10895.35  ...      309665939           15352.25
03-Jan-2019  10796.80  10814.05  ...      286241745           15030.45
04-Jan-2019  10699.70  10741.05  ...      296596655           14516.74
07-Jan-2019  10804.85  10835.95  ...      269371080           12731.29

[5 rows x 6 columns]

In [ ]:
nifty2019['Open']

Date
01-Jan-2019    10881.70
02-Jan-2019    10868.85
03-Jan-2019    10796.80
04-Jan-2019    10699.70
07-Jan-2019    10804.85
                 ...
24-Dec-2019    12269.25
26-Dec-2019    12211.85
27-Dec-2019    12172.90
30-Dec-2019    12274.90
31-Dec-2019    12247.10
Name: Open, Length: 245, dtype: float64

In [ ]:
# 1. In 2019, in how many days was the NIFTY50 volatile (high > 105% of low)

nifty2019['Volatile'] = nifty2019['High'] > (nifty2019['Low'] * 1.05)

In [ ]:
nifty2019

                 Open      High  ...  Turnover (Rs. Cr)  Volatile
Date                             ...
01-Jan-2019  10881.70  10923.60  ...            8688.26     False
02-Jan-2019  10868.85  10895.35  ...           15352.25     False
03-Jan-2019  10796.80  10814.05  ...           15030.45     False
04-Jan-2019  10699.70  10741.05  ...           14516.74     False
07-Jan-2019  10804.85  10835.95  ...           12731.29     False
...               ...       ...  ...                ...       ...
24-Dec-2019  12269.25  12283.70  ...           13864.56     False
26-Dec-2019  12211.85  12221.55  ...           16362.31     False
27-Dec-2019  12172.90  12258.45  ...           13676.20     False
30-Dec-2019  12274.90  12286.45  ...           14556.73     False
31-Dec-2019  12247.10  12247.10  ...           14812.89     False

[245 rows x 7 columns]

In [ ]:
# 2. In 2019, in how many days was the NIFTYNEXT50 volatile (high > 105% of low)

niftynxt2019['Volatile'] = niftynxt2019['High'] > (niftynxt2019['Low'] * 1.05)

In [ ]:
niftynxt2019

                 Open      High  ...  Turnover (Rs. Cr)  Volatile
Date                             ...
01-Jan-2019  28243.95  28252.20  ...            2354.60     False
02-Jan-2019  28074.05  28188.40  ...            3410.28     False
03-Jan-2019  27874.05  28045.30  ...            3362.20     False
04-Jan-2019  27707.20  27842.75  ...            3295.06     False
07-Jan-2019  27893.95  27932.00  ...            2862.02     False
...               ...       ...  ...                ...       ...
24-Dec-2019  28423.70  28430.40  ...            4047.51     False
26-Dec-2019  28409.10  28435.25  ...            4493.23     False
27-Dec-2019  28354.50  28500.25  ...            4776.47     False
30-Dec-2019  28528.95  28612.95  ...            3492.11     False
31-Dec-2019  28495.00  28549.50  ...            4223.10     False

[245 rows x 7 columns]

In [ ]:
print(len(nifty2019[nifty2019['Volatile'] == False]))

244

In [ ]:
# 3. In 2019, how many days belonged to the four classes NIFTY50 volatile/ non-volatile and NIFTYNEXT50 volatile/ non-volatile
nifty2019_volatile = nifty2019['Volatile']
niftynxt2019_volatile = niftynxt2019['Volatile']

df = pd.concat([nifty2019_volatile, niftynxt2019_volatile], axis = 1)
df.columns = ['nifty_volatile', 'niftynxt_volatile']

In [ ]:
df

             nifty_volatile  niftynxt_volatile
Date
01-Jan-2019           False              False
02-Jan-2019           False              False
03-Jan-2019           False              False
04-Jan-2019           False              False
07-Jan-2019           False              False
...                     ...                ...
24-Dec-2019           False              False
26-Dec-2019           False              False
27-Dec-2019           False              False
30-Dec-2019           False              False
31-Dec-2019           False              False

[245 rows x 2 columns]

In [ ]:
# 4. Compute the mean, median, mode, std, var of closing values for the each weekday in NIFTY50 for 2019.

print("Mean:", nifty2019['Close'].mean())
print("Median:", nifty2019['Close'].median())
print("STD:", nifty2019['Close'].std())
print("Variance:", nifty2019['Close'].var())

Mean: 11432.632244897959
Median: 11512.4
STD: 454.2146111618279
Variance: 206310.91299289055

In [ ]:
# 5. Compute the mean, median, mode, std, var of closing values for the each month in NIFTY50 for 2019

In [ ]:
# 6. On the days in which NIFTY50 closed higher than the open, what was the mean of (close - open) for NIFTYNext50

nifty2019con = pd.concat([nifty2019, niftynxt2019],
                      axis = 1,
                      keys = ['nifty50', 'niftynext50'])

In [ ]:
nifty2019con['dif_of_nifty50'] = nifty2019con['nifty50']['Close'] > nifty2019con['nifty50']['Open']

In [ ]:
d = nifty2019con[nifty2019con.dif_of_nifty50 == True]

In [ ]:
diff = d['niftynext50']['Close'] - d['niftynext50']['Open']

In [ ]:
diff

Date
01-Jan-2019   -132.30
04-Jan-2019     12.30
08-Jan-2019    -37.65
15-Jan-2019    109.35
21-Jan-2019   -118.90
                ...
18-Dec-2019     52.05
19-Dec-2019     91.30
20-Dec-2019    124.00
23-Dec-2019     12.20
27-Dec-2019    122.30
Length: 106, dtype: float64

In [ ]:




# 7. In 2019, how many days had the day's high lower than the previous day's low in NIFTY50

# 8. In 2019, how many days did the day's close exceed the 30 day moving average in NIFTY50(exclude first month)